data_gen/base_case/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;

surfaceFormat raw;

interpolationScheme cellPoint;

// Fields to sample.
fields
(
    U
    p
);

surfaces
(
    mainsurf
    {
        type        plane;
        planeType   pointAndNormal;
        pointAndNormalDict
	    {
	        basePoint       (0 0 0.05);
            normalVector    (0 0 1);
        };
   }
);

// *********************************************************************** //